# templates.py

GENERAL_INFORMATION = """Наш номерний фонд складається з 11 номерів тип,
9 з 11 них Стандарт (3 односпальні ліжка), 1 з 11 номер типу стандарт, 
в програмі він вказаний як “Стандарт Сімейний (В + Д)”, 1 з 11 в програмі вказаний як “Cтандарт 4х 2Л+Д” 
там 2 односпальні ліжка і диван(по факту 2 дорослих і 2 дітей до). Далі у нас 4 номери типу Стандарт +, 
вони відрізняються від стандарту наявністю холодильника, Балкон з видом на гори, на балконі стіл і два крісла.
Два номери (28 - Гропа та 20 - Баба Людова) з 4 має двоспальне ліжко та диван, на дивані або 1 дорослий або 2 дітей. 
Номери Хомʼяк має два одоспальні ліжка та ліжко диван. Та номер 26 - Боярин: три одноcпальні ліжка. Номер типу напівлюкс, 
він в нас тільки 1, він буде практично в 2 рази більше ніж Стандарти , він без балкону, він з 1 двоспальним 
ліжко одним односпальним та ліжко диван. Також оснащений холодильником."""

PRESENTATION_ROOMS = """У нас є 3 типи номерів — підкажу коротко про кожен, щоб вам було легше визначитись 😊
🏔 Стандарт — номер для 2 осіб, без балкону.
За потреби можемо доставити додаткове ліжко для 3-ї особи (за доплату).
🌿 Стандарт+ — номер для 2 осіб, з балконом та холодильником.
Також можливе додаткове ліжко для 3-ї особи (за доплату).
✨ Напівлюкс — просторий номер для 3 осіб.
Можливе розміщення до 5 осіб (за доплату).
У номері: 1 двоспальне ліжко, 1 односпальне, диван-ліжко та холодильник.
Підкажіть, будь ласка, який тип номера вас зацікавив і я зорієнтую по вартості 💙"""

QUESTION_ALL_MISSING = "Підкажіть, будь ласка, які дати вас цікавлять, на який термін плануєте зупинитись і скільки буде гостей, чи усі дорослі? Якщо ні - тоді вкажіть вік діток😊?"
QUESTION_MISSING_DATES = "Підкажіть, будь ласка, які дати вас цікавлять, на який термін плануєте зупинитись, чи усі дорослі? Якщо ні - тоді вкажіть вік діток😊"
QUESTION_MISSING_GUESTS = "Підкажіть, будь ласка, скільки буде гостей, чи усі дорослі? Якщо ні - тоді вкажіть вік діток😊?"
QUESTION_MISSING_AGE = "Підкажіть, будь ласка, чи усі дорослі? Якщо ні - тоді вкажіть вік діток😊"
QUESTION_MISSING_DATES_1_CHILD = "Підкажіть, будь ласка, які дати вас цікавлять, на який термін плануєте зупинитись та вкажіть вік дітинки😊?"
QUESTION_MISSING_DATES_CHILDREN = "Підкажіть, будь ласка, які дати вас цікавлять, на який термін плануєте зупинитись та вкажіть вік діток😊?"

CHILDREN = """У нашому готелі діють спеціальні знижки для дітей:
▫️ Дітки до 6 років — проживають безкоштовно(Якщо вони не займають додаткового спального місця)
▫️ Дітки від 6 до 12 років — 50% знижка
▫️ Дітки від 12 до 16 років — 25% знижка"""

PLACE = """📍 Ми розташовані у самому серці Карпат:
Відпочинковий комплекс D&T (Драйв та Турбота) знаходиться в селі Стаїще,
Верховинського району Івано‑Франківської області, всього ~10 км від смт Верховина.
Ось ми на Google maps:
https://maps.app.goo.gl/HujSyynQ4eifdN5N6?g_st=ipc"""

BOOK_ROOM = """Щоб забронювати номер, потрібно внести аванс — 50% від вартості проживання.
За бажанням ви можете оплатити повну суму одразу.

📆 У разі скасування не пізніше ніж за 10 днів до заїзду — ми повертаємо сплачену суму у повному обсязі.

💳 Реквізити для оплати:
IBAN: UA693006580000026005064100017
Отримувач: ФОП Данилів Руслан Ігорович
ЄДРПОУ: 2735905553
Призначення платежу: Оплата за бронювання проживання

🔁 Після оплати надішліть, будь ласка, квитанцію або скрін платежу для підтвердження."""

POOL = """Наш басейн з підігрівом працює щодня з 10:00 до 22:00 🏊
Розмір: 12×6 м, глибина — 140 см.
Поруч — зона відпочинку з лежаками та чудовим краєвидом на гори 🌄
Користування басейном входить у вартість проживання."""

EAT = """На території готелю працює колиба, яка надає повноцінне харчування для гостей.
При замовленні 2- або 3-разового харчування надаємо знижку.
Підкажіть, будь ласка, які прийоми їжі вас цікавлять, і ми прорахуємо вартість зі знижкою."""

PRICE_JUNE = """✨ Актуальні ціни на червень:
🏔 Стандарт — від 2000 грн
🌿 Стандарт+ — від 2400 грн
✨ Напівлюкс — від 2500 грн
💡 Вартість може змінюватися залежно від кількості осіб та дня тижня.
🏡 Усі номери мають власний санвузол для вашої зручності 🚿
🏊‍♂️ Басейн з підігрівом входить у вартість проживання.
💡 Точну вартість повідомимо після узгодження дат, кількості осіб та деталей проживання 😊
Підкажіть, який тип номеру вас цікавить?"""

PRICE_JULY = """✨ Актуальні ціни на липень:
🏔 Стандарт — від 2200 грн
🌿 Стандарт+ — від 2600 грн
✨ Напівлюкс — від 3200 грн
💡 Вартість може змінюватися залежно від кількості осіб та дня тижня.
🏡 Усі номери мають власний санвузол для вашої зручності 🚿
🏊‍♂️ Басейн з підігрівом входить у вартість проживання.
💡 Точну вартість повідомимо після узгодження дат, кількості осіб та деталей проживання 😊
Підкажіть, який тип номеру вас цікавить?"""

PRICE_AUGUST = """✨ Актуальні ціни на серпень:
🏔 Стандарт — від 2400 грн
🌿 Стандарт+ — від 2800 грн
✨ Напівлюкс — від 3500 грн
💡 Вартість може змінюватися залежно від кількості осіб та дня тижня.
🏡 Усі номери мають власний санвузол для вашої зручності 🚿
🏊‍♂️ Басейн з підігрівом входить у вартість проживання.
💡 Точну вартість повідомимо після узгодження дат, кількості осіб та деталей проживання ☺️
Підкажіть, який тип номеру вас цікавить?"""

PETS = """Так, у нас дозволено проживання з домашніми улюбленцями вагою до 10 кг 🐾
Підкажіть, будь ласка:
– Якої породи й розміру ваша собака?  
– Чи має ветпаспорт зі щепленнями?  
– Чи буде залишатись у номері сама?  
– Чи маєте для неї все необхідне: лежанку, миски, повідок?
Також надаємо файл із правилами проживання з тваринами — ознайомтесь, будь ласка 😇"""

BAR = """У нас на території є бар 🍹
Тут можна замовити як швидкі перекуси, так і страви на мангалі.
Також бар пропонує елітний алкоголь та різноманітні напої.
Якщо бажаєте — у нас є партнери, які надають комплексне харчування (сніданки, обіди, вечері) з доставкою швидко та зручно 🚚🍲"""

GUEST_POOL = """Для відвідувачів, які не проживають у нас, вартість становить:
У будні дні:
▫️ 400 грн / дорослий на день
▫️ 200 грн / діти до 12 років
▫️ Діти до 3 років — безкоштовно
У вихідні та святкові:
▫️ 600 грн / дорослий на день
▫️ 300 грн / діти до 12 років
▫️ Діти до 3 років — безкоштовно
У вартість входить доступ до басейну, зони з лежаками та неймовірний вид на гори 🌄
Бажаєте забронювати або приїхати на день? Напишіть нам у дірект — будемо раді вас бачити! 💙"""

MILITARY = """Так ми надаєм знижки військовослужбовцям (20%), при поселені потрібно показати УБД."""

PRICE_CALLCULATION = """Вартість номеру типу {тип номеру}, для {кількість осіб}, на {кількість ночей} ({дати}), буде вартувати - {вартість} грн. Якщо вас цікавить інший тип номеру, або інша кількість осіб, або інші дати - напишіть мені і я з радістю прорахую для вас вартість! 💙 Бажаєте забронювати?"""

ROOM_BOOKED = """На жаль, номери категорії {тип номеру} на ваші дати вже повністю заброньовані 😔. 
Проте маємо вільні: {вільні_номери} (на ці ж дати), або можемо запропонувати інші найближчі вільні дати. 
Підкажіть, який варіант вам підходить? 💙"""

INCLUDED_IN_THE_PRICE = """У вартість входить: проживання, паркування, користування басейном з підігрівом,
користування лежаками і парасолями біля басейну, додаткові рушники для басейну,
користування альтанками, мангалом, спортивні майданчики, доступ до річки, настільний теніс, бадмінтон, шахи, нарди."""

BREAKFAST_IN_THE_PRICE = """Ні сніданки не входять у вартість.
На території готелю працює колиба, яка надає повноцінне харчування для гостей.
При замовленні 2- або 3-разового харчування надаємо знижку. Підкажіть, будь ласка,
які прийоми їжі вас цікавлять, і ми прорахуємо вартість зі знижкою."""

KITCHEN = """У нас немає кухні для самостійного приготування їжі,
але на території готелю працює колиба, яка надає повноцінне харчування для гостей.
Також ми співпрацюємо з місцевими ресторанами та доставкою їжі, які можуть швидко доставити вам смачні страви прямо до готелю.
Якщо вас цікавить ця опція, я з радістю допоможу вам з вибором та замовленням! 🍽️🚚"""

NEAREST_DATES = """Найближчі вільні дати для номеру типу {тип номеру}, {найближчі_дати}. Підкажіть, чи підходить вам цей варіант? 💙"""